apache/mynewt-core/hw/mcu/stm/stm32_common/src/stm32_hw_id.c
/*
 * Licensed to the Apache Software Foundation (ASF) under one
 * or more contributor license agreements.  See the NOTICE file
 * distributed with this work for additional information
 * regarding copyright ownership.  The ASF licenses this file
 * to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 * KIND, either express or implied.  See the License for the
 * specific language governing permissions and limitations
 * under the License.
 */

#include <inttypes.h>
#include <string.h>

#include "mcu/stm32_hal.h"
#include <hal/hal_bsp.h>

#ifdef STM32H5
#include <stm32h5xx_ll_dcache.h>
#include <stm32h5xx_ll_icache.h>
#endif

#ifndef min
#define min(a, b) ((a)<(b)?(a):(b))
#endif

#define STM32_HW_ID_LEN     12

int
hal_bsp_hw_id_len(void)
{
    return STM32_HW_ID_LEN;
}

#ifndef DCACHE1
/* H503 devices do not have DCACHE */
#define LL_DCACHE_IsEnabled(dcache) 0
#define LL_DCACHE_Enable(dcache)
#define LL_DCACHE_Disable(dcache)
#endif

int
hal_bsp_hw_id(uint8_t *id, int max_len)
{
    int cnt;
#ifdef STM32H5
    uint32_t dcache_enabled = LL_DCACHE_IsEnabled(DCACHE1);
    uint32_t icache_enabled = LL_ICACHE_IsEnabled();

    if (dcache_enabled) {
        LL_DCACHE_Disable(DCACHE1);
    }
    if (icache_enabled) {
        LL_ICACHE_Disable();
    }
#endif

    cnt = min(STM32_HW_ID_LEN, max_len);
    memcpy(id, (void *)UID_BASE, cnt);

#ifdef STM32H5
    if (icache_enabled) {
        LL_ICACHE_Enable();
    }
    if (dcache_enabled) {
        LL_DCACHE_Enable(DCACHE1);
    }
#endif

    return cnt;
}
